<a href="https://colab.research.google.com/github/drm1072/Workload-DRM/blob/main/DataScienceBasics_with_Python_part_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np  #Numpy provides fast mathematical function processing
#We use np as a quick way to execute code same thing as pandas pd
import pandas as pd #Used for high level Data Indexing processes

In [3]:
#1st number represents (rows/attributes)
#2nd number represents (features/columns)
#the columns must match the column number in the list
#random gives us random numbers
Newdata = pd.DataFrame(np.random.randn(22, 4), columns=['Numbers1', 'Numbers2', 'Numbers3', 'Numbers4'])

In [4]:
#This gives us random numbers within 4 columns and 22 rows
Newdata

    Numbers1  Numbers2  Numbers3  Numbers4
0   0.987705 -1.037676 -1.582057  0.391924
1   0.554321 -1.009975 -0.160262 -2.092348
2  -0.501563  0.622408 -0.965643 -0.522200
3   0.788007 -0.175884  1.170487 -1.080783
4  -0.639451 -0.288055  0.972606 -1.683573
5   1.054618  1.611970  1.075044  0.428583
6   0.844754  1.493330 -1.278713  1.337129
7   0.595959  0.178159  0.543953 -0.066950
8   0.372750  0.236555 -0.282945  0.056602
9   1.753986  0.875368 -0.609239  0.255834
10 -0.888809 -1.424787 -0.340378  0.499547
11  1.636619  1.789345  0.669885  1.318895
12  1.062835 -0.621257  1.721254 -0.086995
13  0.287430 -0.236557  0.699683  0.594719
14  0.200550 -1.214720 -0.488136 -0.384846
15  0.801958  0.791415 -0.431905 -0.533371
16  1.085183  1.411630 -0.119510  1.211080
17  1.970204 -1.117760  1.829937 -0.758175
18  1.085091  2.292062  0.046482 -0.041573
19  0.139993 -0.601590 -1.435133 -1.110907
20  1.600411 -0.564745  0.149481 -1.190592
21  0.071676 -0.231492 -0.515688 -0.346307

In [6]:
#Creating another dataframe
Newdata2 = pd.DataFrame(np.random.randn(4,3), columns=['Numbers1', 'Numbers2', 'Numbers3'])

In [8]:
Newdata3=Newdata + Newdata2

In [9]:
#We see a ton of NAN values
Newdata3

    Numbers1  Numbers2  Numbers3  Numbers4
0   1.574320 -2.921498 -0.362045       NaN
1  -0.194478 -1.895272  0.582077       NaN
2   0.131017  0.908011 -0.969344       NaN
3   1.758891 -0.804878  2.472034       NaN
4        NaN       NaN       NaN       NaN
5        NaN       NaN       NaN       NaN
6        NaN       NaN       NaN       NaN
7        NaN       NaN       NaN       NaN
8        NaN       NaN       NaN       NaN
9        NaN       NaN       NaN       NaN
10       NaN       NaN       NaN       NaN
11       NaN       NaN       NaN       NaN
12       NaN       NaN       NaN       NaN
13       NaN       NaN       NaN       NaN
14       NaN       NaN       NaN       NaN
15       NaN       NaN       NaN       NaN
16       NaN       NaN       NaN       NaN
17       NaN       NaN       NaN       NaN
18       NaN       NaN       NaN       NaN
19       NaN       NaN       NaN       NaN
20       NaN       NaN       NaN       NaN
21       NaN       NaN       NaN       NaN

In [10]:
Newdata3. fillna("")
#this quickest way to replace NULL/Nan values

    Numbers1  Numbers2  Numbers3 Numbers4
0    1.57432   -2.9215 -0.362045
1  -0.194478  -1.89527  0.582077
2   0.131017  0.908011 -0.969344
3    1.75889 -0.804878   2.47203
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21

In [11]:
#Now lets drop the rows in our dataframe that are missing
#subset specifies the column to look for missing rows
#We choose numbers1 since it is the 1st column in our dataframe
Newdata4=Newdata3.dropna(subset=["Numbers1"])

In [12]:
Newdata4

   Numbers1  Numbers2  Numbers3  Numbers4
0  1.574320 -2.921498 -0.362045       NaN
1 -0.194478 -1.895272  0.582077       NaN
2  0.131017  0.908011 -0.969344       NaN
3  1.758891 -0.804878  2.472034       NaN

In [17]:
#removing the last column because it has all of the nan/null values
#NaN = Not a number or null value
del Newdata4['Numbers4']

In [18]:
Newdata4

   Numbers1  Numbers2  Numbers3
0  1.574320 -2.921498 -0.362045
1 -0.194478 -1.895272  0.582077
2  0.131017  0.908011 -0.969344
3  1.758891 -0.804878  2.472034

In [21]:
Newdata5= pd.DataFrame([[5, 6, 9],[9,88,45],[12,77,15]])

In [22]:
Newdata5

    0   1   2
0   5   6   9
1   9  88  45
2  12  77  15

In [23]:
Newdata6=Newdata4.append(Newdata5)

In [24]:
Newdata6

   Numbers1  Numbers2  Numbers3     0     1     2
0  1.574320 -2.921498 -0.362045   NaN   NaN   NaN
1 -0.194478 -1.895272  0.582077   NaN   NaN   NaN
2  0.131017  0.908011 -0.969344   NaN   NaN   NaN
3  1.758891 -0.804878  2.472034   NaN   NaN   NaN
0       NaN       NaN       NaN   5.0   6.0   9.0
1       NaN       NaN       NaN   9.0  88.0  45.0
2       NaN       NaN       NaN  12.0  77.0  15.0

In [25]:
Newdata7=Newdata6.rename(columns={0: 'Numbers4', 1: 'Numbers5', 2: "Numbers6"})

In [26]:
Newdata7

   Numbers1  Numbers2  Numbers3  Numbers4  Numbers5  Numbers6
0  1.574320 -2.921498 -0.362045       NaN       NaN       NaN
1 -0.194478 -1.895272  0.582077       NaN       NaN       NaN
2  0.131017  0.908011 -0.969344       NaN       NaN       NaN
3  1.758891 -0.804878  2.472034       NaN       NaN       NaN
0       NaN       NaN       NaN       5.0       6.0       9.0
1       NaN       NaN       NaN       9.0      88.0      45.0
2       NaN       NaN       NaN      12.0      77.0      15.0

In [27]:
#Lets clean up those NaN Values
Newdata8=Newdata7. fillna("6")
#this quickest way to replace NULL/Nan values

In [28]:
Newdata8

   Numbers1  Numbers2  Numbers3 Numbers4 Numbers5 Numbers6
0   1.57432   -2.9215 -0.362045        6        6        6
1 -0.194478  -1.89527  0.582077        6        6        6
2  0.131017  0.908011 -0.969344        6        6        6
3   1.75889 -0.804878   2.47203        6        6        6
0         6         6         6        5        6        9
1         6         6         6        9       88       45
2         6         6         6       12       77       15

In [29]:
#This code fixes our indexing after we added new data
Newdata9=Newdata8.reset_index(drop=True)

In [30]:
Newdata9

   Numbers1  Numbers2  Numbers3 Numbers4 Numbers5 Numbers6
0   1.57432   -2.9215 -0.362045        6        6        6
1 -0.194478  -1.89527  0.582077        6        6        6
2  0.131017  0.908011 -0.969344        6        6        6
3   1.75889 -0.804878   2.47203        6        6        6
4         6         6         6        5        6        9
5         6         6         6        9       88       45
6         6         6         6       12       77       15

In [31]:
#Checking data types
Newdata9.dtypes

Numbers1    object
Numbers2    object
Numbers3    object
Numbers4    object
Numbers5    object
Numbers6    object
dtype: object

In [32]:
#Converting our objects into a float
Newdata10= Newdata9.astype(float)

In [33]:
Newdata10.dtypes

Numbers1    float64
Numbers2    float64
Numbers3    float64
Numbers4    float64
Numbers5    float64
Numbers6    float64
dtype: object

In [34]:
Newdata10

   Numbers1  Numbers2  Numbers3  Numbers4  Numbers5  Numbers6
0  1.574320 -2.921498 -0.362045       6.0       6.0       6.0
1 -0.194478 -1.895272  0.582077       6.0       6.0       6.0
2  0.131017  0.908011 -0.969344       6.0       6.0       6.0
3  1.758891 -0.804878  2.472034       6.0       6.0       6.0
4  6.000000  6.000000  6.000000       5.0       6.0       9.0
5  6.000000  6.000000  6.000000       9.0      88.0      45.0
6  6.000000  6.000000  6.000000      12.0      77.0      15.0

In [35]:
#This tells us how many different numbers make up data in the column
Newdata10.nunique()

Numbers1    5
Numbers2    5
Numbers3    5
Numbers4    4
Numbers5    3
Numbers6    4
dtype: int64

In [36]:
#Gives us the number of times this value shows up in the column
#This only works with columns
Newdata10['Numbers2'].value_counts()

 6.000000    3
 0.908011    1
-1.895272    1
-0.804878    1
-2.921498    1
Name: Numbers2, dtype: int64

In [37]:
#This .describe function is commonly used to evaluate data for quick analysis
#count tells us that every row is equal in both columns
#mean tells us the average of the values in each column
#standard deviation is the disparity between each number and the mean
#A low standard deviation means that most of the numbers are close to the avearage
#A high standard deviation means that the numbers are more spread out
#25% of data is below the mean
#50% of data is below the mean
#75% of data is below the mean
Newdata10.describe()

       Numbers1  Numbers2  Numbers3   Numbers4   Numbers5   Numbers6
count  7.000000  7.000000  7.000000   7.000000   7.000000   7.000000
mean   3.038536  1.898052  2.817532   7.142857  27.857143  13.285714
std    2.857688  4.007936  3.160988   2.478479  37.462998  14.372593
min   -0.194478 -2.921498 -0.969344   5.000000   6.000000   6.000000
25%    0.852669 -1.350075  0.110016   6.000000   6.000000   6.000000
50%    1.758891  0.908011  2.472034   6.000000   6.000000   6.000000
75%    6.000000  6.000000  6.000000   7.500000  41.500000  12.000000
max    6.000000  6.000000  6.000000  12.000000  88.000000  45.000000

's': second

'min': minute

'H':hour

'D':Day

'w':week

'm':month

'A':End of Year

'AS':Start of year

In [43]:
pd.date_range('6/24/2020', periods=8, freq='n')

DatetimeIndex([          '2020-06-24 00:00:00',
               '2020-06-24 00:00:00.000000001',
               '2020-06-24 00:00:00.000000002',
               '2020-06-24 00:00:00.000000003',
               '2020-06-24 00:00:00.000000004',
               '2020-06-24 00:00:00.000000005',
               '2020-06-24 00:00:00.000000006',
               '2020-06-24 00:00:00.000000007'],
              dtype='datetime64[ns]', freq='N')

In [44]:
pd.date_range('6/24/2020', periods=8, freq='d')

DatetimeIndex(['2020-06-24', '2020-06-25', '2020-06-26', '2020-06-27',
               '2020-06-28', '2020-06-29', '2020-06-30', '2020-07-01'],
              dtype='datetime64[ns]', freq='D')

In [45]:
#This is for when you want to index time by year
pd.date_range('6/24/2020', periods=8, freq=pd.DateOffset(years=1))

DatetimeIndex(['2020-06-24', '2021-06-24', '2022-06-24', '2023-06-24',
               '2024-06-24', '2025-06-24', '2026-06-24', '2027-06-24'],
              dtype='datetime64[ns]', freq='<DateOffset: years=1>')

In [46]:
#Lets use a dictionary to accomplish the same thing
Cars = {'VW': 2011,
        'Ford': 1993,
        'Chevy': 2010,
        'Dodge': 2002,}

In [47]:
Cars

{'Chevy': 2010, 'Dodge': 2002, 'Ford': 1993, 'VW': 2011}

In [48]:
#So now lets turn this into an array dataframe
Cars2=pd.Series(Cars)

In [49]:
Cars2

VW       2011
Ford     1993
Chevy    2010
Dodge    2002
dtype: int64

In [50]:
Cars3 = pd.DataFrame({'Car Model':Cars2.index, 'Car Year': Cars2.values})

In [51]:
Cars3

  Car Model  Car Year
0        VW      2011
1      Ford      1993
2     Chevy      2010
3     Dodge      2002